Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA204.h
extern volatile U1ADMDBITS U1ADMDbits __attribute__((__sfr__));

#define U1SCCON U1SCCON
extern volatile unsigned int  U1SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU1SCCONBITS {
  union {
    struct {
      unsigned SCEN:1;
      unsigned PTRCL:1;
      unsigned T0PD:1;
      unsigned CONV:1;
      unsigned TXRPT:2;
    };
    struct {
      unsigned :4;
      unsigned TXRPT0:1;
      unsigned TXRPT1:1;
    };
  };
} U1SCCONBITS;
extern volatile U1SCCONBITS U1SCCONbits __attribute__((__sfr__));

#define U1SCINT U1SCINT
extern volatile unsigned int  U1SCINT __attribute__((__sfr__));
typedef struct tagU1SCINTBITS {
  unsigned GTCIE:1;
  unsigned WTCIE:1;
  unsigned :2;
  unsigned TXRPTIE:1;
  unsigned RXRPTIE:1;
  unsigned PARIE:1;
  unsigned :1;
  unsigned GTCIF:1;
  unsigned WTCIF:1;
  unsigned :2;
  unsigned TXRPTIF:1;
  unsigned RXRPTIF:1;
} U1SCINTBITS;
extern volatile U1SCINTBITS U1SCINTbits __attribute__((__sfr__));

#define U1GTC U1GTC
extern volatile unsigned int  U1GTC __attribute__((__sfr__));
__extension__ typedef struct tagU1GTCBITS {
  union {
    struct {
      unsigned GTC:9;
    };
    struct {
      unsigned GTC0:1;
      unsigned GTC1:1;
      unsigned GTC2:1;
      unsigned GTC3:1;
      unsigned GTC4:1;
      unsigned GTC5:1;
      unsigned GTC6:1;
      unsigned GTC7:1;
      unsigned GTC8:1;
    };
  };
} U1GTCBITS;
extern volatile U1GTCBITS U1GTCbits __attribute__((__sfr__));

#define U1WTCL U1WTCL
extern volatile unsigned int  U1WTCL __attribute__((__sfr__));
__extension__ typedef struct tagU1WTCLBITS {
  union {
    struct {
      unsigned WTCL:16;
    };
    struct {
      unsigned WTC0:1;
      unsigned WTC1:1;
      unsigned WTC2:1;
      unsigned WTC3:1;
      unsigned WTC4:1;
      unsigned WTC5:1;
      unsigned WTC6:1;
      unsigned WTC7:1;
      unsigned WTC8:1;
      unsigned WTC9:1;
      unsigned WTC10:1;
      unsigned WTC11:1;
      unsigned WTC12:1;
      unsigned WTC13:1;
      unsigned WTC14:1;
      unsigned WTC15:1;
    };
  };
} U1WTCLBITS;
extern volatile U1WTCLBITS U1WTCLbits __attribute__((__sfr__));

#define U1WTCH U1WTCH
extern volatile unsigned int  U1WTCH __attribute__((__sfr__));
__extension__ typedef struct tagU1WTCHBITS {
  union {
    struct {
      unsigned WTCH:8;
    };
    struct {
      unsigned WTC16:1;
      unsigned WTC17:1;
      unsigned WTC18:1;
      unsigned WTC19:1;
      unsigned WTC20:1;
      unsigned WTC21:1;
      unsigned WTC22:1;
      unsigned WTC23:1;
    };
  };
} U1WTCHBITS;
extern volatile U1WTCHBITS U1WTCHbits __attribute__((__sfr__));

#define U2MODE U2MODE
extern volatile unsigned int  U2MODE __attribute__((__sfr__));
__extension__ typedef struct tagU2MODEBITS {
  union {
    struct {
      unsigned STSEL:1;
      unsigned PDSEL:2;
      unsigned BRGH:1;
      unsigned URXINV:1;
      unsigned ABAUD:1;
      unsigned LPBACK:1;
      unsigned WAKE:1;
      unsigned UEN:2;
      unsigned :1;
      unsigned RTSMD:1;
      unsigned IREN:1;
      unsigned USIDL:1;
      unsigned :1;
      unsigned UARTEN:1;
    };
    struct {
      unsigned :1;
      unsigned PDSEL0:1;
      unsigned PDSEL1:1;
      unsigned :1;
      unsigned RXINV:1;
      unsigned :3;
      unsigned UEN0:1;
      unsigned UEN1:1;
    };
  };
} U2MODEBITS;
extern volatile U2MODEBITS U2MODEbits __attribute__((__sfr__));

#define U2STA U2STA
extern volatile unsigned int  U2STA __attribute__((__sfr__));
__extension__ typedef struct tagU2STABITS {
  union {
    struct {
      unsigned URXDA:1;
      unsigned OERR:1;
      unsigned FERR:1;
      unsigned PERR:1;
      unsigned RIDLE:1;
      unsigned ADDEN:1;
      unsigned URXISEL:2;
      unsigned TRMT:1;
      unsigned UTXBF:1;
      unsigned UTXEN:1;
      unsigned UTXBRK:1;
      unsigned URXEN:1;
      unsigned UTXISEL0:1;
      unsigned UTXINV:1;
      unsigned UTXISEL1:1;
    };
    struct {
      unsigned :6;
      unsigned URXISEL0:1;
      unsigned URXISEL1:1;
    };
  };
} U2STABITS;
extern volatile U2STABITS U2STAbits __attribute__((__sfr__));

#define U2TXREG U2TXREG
extern volatile unsigned int  U2TXREG __attribute__((__sfr__));
typedef struct tagU2TXREGBITS {
  unsigned :15;
  unsigned LAST:1;
} U2TXREGBITS;
extern volatile U2TXREGBITS U2TXREGbits __attribute__((__sfr__));

#define U2RXREG U2RXREG
extern volatile unsigned int  U2RXREG __attribute__((__sfr__));
#define U2BRG U2BRG
extern volatile unsigned int  U2BRG __attribute__((__sfr__));
#define U2ADMD U2ADMD
extern volatile unsigned int  U2ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU2ADMDBITS {
  union {
    struct {
      unsigned ADMADDR:8;
      unsigned ADMMASK:8;
    };
    struct {
      unsigned ADMADDR0:1;
      unsigned ADMADDR1:1;
      unsigned ADMADDR2:1;
      unsigned ADMADDR3:1;
      unsigned ADMADDR4:1;
      unsigned ADMADDR5:1;
      unsigned ADMADDR6:1;
      unsigned ADMADDR7:1;
      unsigned ADMMASK0:1;
      unsigned ADMMASK1:1;
      unsigned ADMMASK2:1;
      unsigned ADMMASK3:1;
      unsigned ADMMASK4:1;
      unsigned ADMMASK5:1;
      unsigned ADMMASK6:1;
      unsigned ADMMASK7:1;
    };
  };
} U2ADMDBITS;
extern volatile U2ADMDBITS U2ADMDbits __attribute__((__sfr__));

#define U2SCCON U2SCCON
extern volatile unsigned int  U2SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU2SCCONBITS {
  union {
    struct {
      unsigned SCEN:1;
      unsigned PTRCL:1;
      unsigned T0PD:1;
      unsigned CONV:1;
      unsigned TXRPT:2;
    };
    struct {
      unsigned :4;
      unsigned TXRPT0:1;
      unsigned TXRPT1:1;
    };
  };
} U2SCCONBITS;
extern volatile U2SCCONBITS U2SCCONbits __attribute__((__sfr__));

#define U2SCINT U2SCINT
extern volatile unsigned int  U2SCINT __attribute__((__sfr__));
typedef struct tagU2SCINTBITS {
  unsigned GTCIE:1;
  unsigned WTCIE:1;
  unsigned :2;
  unsigned TXRPTIE:1;
  unsigned RXRPTIE:1;
  unsigned PARIE:1;
  unsigned :1;
  unsigned GTCIF:1;
  unsigned WTCIF:1;
  unsigned :2;
  unsigned TXRPTIF:1;
  unsigned RXRPTIF:1;
} U2SCINTBITS;
extern volatile U2SCINTBITS U2SCINTbits __attribute__((__sfr__));

