Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA204.h
#define _I2C1CONH_AHEN_POSITION                  0x00000001
#define _I2C1CONH_AHEN_MASK                      0x00000002
#define _I2C1CONH_AHEN_LENGTH                    0x00000001

#define _I2C1CONH_SBCDE_POSITION                 0x00000002
#define _I2C1CONH_SBCDE_MASK                     0x00000004
#define _I2C1CONH_SBCDE_LENGTH                   0x00000001

#define _I2C1CONH_SDAHT_POSITION                 0x00000003
#define _I2C1CONH_SDAHT_MASK                     0x00000008
#define _I2C1CONH_SDAHT_LENGTH                   0x00000001

#define _I2C1CONH_BOEN_POSITION                  0x00000004
#define _I2C1CONH_BOEN_MASK                      0x00000010
#define _I2C1CONH_BOEN_LENGTH                    0x00000001

#define _I2C1CONH_SCIE_POSITION                  0x00000005
#define _I2C1CONH_SCIE_MASK                      0x00000020
#define _I2C1CONH_SCIE_LENGTH                    0x00000001

#define _I2C1CONH_PCIE_POSITION                  0x00000006
#define _I2C1CONH_PCIE_MASK                      0x00000040
#define _I2C1CONH_PCIE_LENGTH                    0x00000001

#define _I2C1STAT_TBF_POSITION                   0x00000000
#define _I2C1STAT_TBF_MASK                       0x00000001
#define _I2C1STAT_TBF_LENGTH                     0x00000001

#define _I2C1STAT_RBF_POSITION                   0x00000001
#define _I2C1STAT_RBF_MASK                       0x00000002
#define _I2C1STAT_RBF_LENGTH                     0x00000001

#define _I2C1STAT_R_NOT_W_POSITION               0x00000002
#define _I2C1STAT_R_NOT_W_MASK                   0x00000004
#define _I2C1STAT_R_NOT_W_LENGTH                 0x00000001

#define _I2C1STAT_S_POSITION                     0x00000003
#define _I2C1STAT_S_MASK                         0x00000008
#define _I2C1STAT_S_LENGTH                       0x00000001

#define _I2C1STAT_P_POSITION                     0x00000004
#define _I2C1STAT_P_MASK                         0x00000010
#define _I2C1STAT_P_LENGTH                       0x00000001

#define _I2C1STAT_D_NOT_A_POSITION               0x00000005
#define _I2C1STAT_D_NOT_A_MASK                   0x00000020
#define _I2C1STAT_D_NOT_A_LENGTH                 0x00000001

#define _I2C1STAT_I2COV_POSITION                 0x00000006
#define _I2C1STAT_I2COV_MASK                     0x00000040
#define _I2C1STAT_I2COV_LENGTH                   0x00000001

#define _I2C1STAT_IWCOL_POSITION                 0x00000007
#define _I2C1STAT_IWCOL_MASK                     0x00000080
#define _I2C1STAT_IWCOL_LENGTH                   0x00000001

#define _I2C1STAT_ADD10_POSITION                 0x00000008
#define _I2C1STAT_ADD10_MASK                     0x00000100
#define _I2C1STAT_ADD10_LENGTH                   0x00000001

#define _I2C1STAT_GCSTAT_POSITION                0x00000009
#define _I2C1STAT_GCSTAT_MASK                    0x00000200
#define _I2C1STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C1STAT_BCL_POSITION                   0x0000000A
#define _I2C1STAT_BCL_MASK                       0x00000400
#define _I2C1STAT_BCL_LENGTH                     0x00000001

#define _I2C1STAT_ACKTIM_POSITION                0x0000000D
#define _I2C1STAT_ACKTIM_MASK                    0x00002000
#define _I2C1STAT_ACKTIM_LENGTH                  0x00000001

#define _I2C1STAT_TRSTAT_POSITION                0x0000000E
#define _I2C1STAT_TRSTAT_MASK                    0x00004000
#define _I2C1STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C1STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C1STAT_ACKSTAT_MASK                   0x00008000
#define _I2C1STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C1STAT_R_W_POSITION                   0x00000002
#define _I2C1STAT_R_W_MASK                       0x00000004
#define _I2C1STAT_R_W_LENGTH                     0x00000001

#define _I2C1STAT_D_A_POSITION                   0x00000005
#define _I2C1STAT_D_A_MASK                       0x00000020
#define _I2C1STAT_D_A_LENGTH                     0x00000001

#define _I2C1STAT_RW_POSITION                    0x00000002
#define _I2C1STAT_RW_MASK                        0x00000004
#define _I2C1STAT_RW_LENGTH                      0x00000001

#define _I2C1STAT_DA_POSITION                    0x00000005
#define _I2C1STAT_DA_MASK                        0x00000020
#define _I2C1STAT_DA_LENGTH                      0x00000001

#define _I2C1ADD_ADD_POSITION                    0x00000000
#define _I2C1ADD_ADD_MASK                        0x000003FF
#define _I2C1ADD_ADD_LENGTH                      0x0000000A

#define _I2C1MSK_MSK_POSITION                    0x00000000
#define _I2C1MSK_MSK_MASK                        0x000003FF
#define _I2C1MSK_MSK_LENGTH                      0x0000000A

#define _I2C1MSK_AMSK_POSITION                   0x00000000
#define _I2C1MSK_AMSK_MASK                       0x000003FF
#define _I2C1MSK_AMSK_LENGTH                     0x0000000A

#define _I2C2RCV_I2CRXDATA_POSITION              0x00000000
#define _I2C2RCV_I2CRXDATA_MASK                  0x000000FF
#define _I2C2RCV_I2CRXDATA_LENGTH                0x00000008

#define _I2C2TRN_I2CTXDATA_POSITION              0x00000000
#define _I2C2TRN_I2CTXDATA_MASK                  0x000000FF
#define _I2C2TRN_I2CTXDATA_LENGTH                0x00000008

#define _I2C2CON1_SEN_POSITION                   0x00000000
#define _I2C2CON1_SEN_MASK                       0x00000001
#define _I2C2CON1_SEN_LENGTH                     0x00000001

#define _I2C2CON1_RSEN_POSITION                  0x00000001
#define _I2C2CON1_RSEN_MASK                      0x00000002
#define _I2C2CON1_RSEN_LENGTH                    0x00000001

#define _I2C2CON1_PEN_POSITION                   0x00000002
#define _I2C2CON1_PEN_MASK                       0x00000004
#define _I2C2CON1_PEN_LENGTH                     0x00000001

#define _I2C2CON1_RCEN_POSITION                  0x00000003
#define _I2C2CON1_RCEN_MASK                      0x00000008
#define _I2C2CON1_RCEN_LENGTH                    0x00000001

#define _I2C2CON1_ACKEN_POSITION                 0x00000004
#define _I2C2CON1_ACKEN_MASK                     0x00000010
#define _I2C2CON1_ACKEN_LENGTH                   0x00000001

#define _I2C2CON1_ACKDT_POSITION                 0x00000005
#define _I2C2CON1_ACKDT_MASK                     0x00000020
#define _I2C2CON1_ACKDT_LENGTH                   0x00000001

#define _I2C2CON1_STREN_POSITION                 0x00000006
#define _I2C2CON1_STREN_MASK                     0x00000040
#define _I2C2CON1_STREN_LENGTH                   0x00000001

